package ShenSha

import (
	. "github.com/warrially/BaziGo/Common"
)

/*
// 神煞, http://www.131.com.tw/word/b3_2_10.htm
// 以年支對照月日時支神煞表
var SHEN_SHA_YEAR_ZHI_ZHI_STR = []string{
	"金匱", "紅鸞", "天喜", "龍德", "福德", "喪門", "勾絞", "五鬼", "破碎", "大耗", "白虎", "天狗", "桃花", "血刃", "+ -元辰", "- +元辰", "伏吟", "劫煞", "災煞", "六厄"}
var SHEN_SHA_YEAR_ZHI_ZHI_LIST = [][12]int{
	// 子 丑 寅 卯 辰 巳 午 未 申 酉 戌 亥
	// 0  1  2  3  4  5  6  7  8  9  10 11
	{0, 9, 6, 3, 0, 9, 6, 3, 0, 9, 6, 3},    // 金匱
	{3, 2, 1, 0, 11, 10, 9, 8, 7, 6, 5, 4},  // 紅鸞
	{9, 8, 7, 6, 5, 4, 3, 2, 1, 0, 11, 10},  // 天喜
	{7, 8, 9, 10, 11, 0, 1, 2, 3, 4, 5, 6},  // 龍德
	{9, 10, 11, 0, 1, 2, 3, 4, 5, 6, 7, 8},  // 福德
	{2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 0, 1},  // 喪門
	{3, 4, 5, 6, 7, 8, 9, 10, 11, 0, 1, 2},  // 勾絞
	{4, 5, 6, 7, 8, 9, 10, 11, 0, 1, 2, 3},  // 五鬼
	{6, 7, 8, 9, 10, 11, 0, 1, 2, 3, 4, 5},  // 破碎
	{6, 7, 8, 9, 10, 11, 0, 1, 2, 3, 4, 5},  // 大耗
	{8, 9, 10, 11, 0, 1, 2, 3, 4, 5, 6, 7},  // 白虎
	{10, 11, 0, 1, 2, 3, 4, 5, 6, 7, 8, 9},  // 天狗
	{9, 6, 3, 0, 9, 6, 3, 0, 9, 6, 3, 0},    // 桃花
	{10, 9, 8, 7, 6, 5, 4, 3, 2, 1, 0, 11},  // 血刃
	{7, 8, 9, 10, 11, 0, 1, 2, 3, 4, 5, 6},  // + -元辰
	{5, 6, 7, 8, 9, 10, 11, 0, 1, 2, 3, 4},  // - +元辰
	{0, 1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11},  // 伏吟
	{5, 2, 11, 8, 5, 2, 11, 8, 5, 2, 11, 8}, // 劫煞
	{6, 3, 0, 9, 6, 3, 0, 9, 6, 3, 0, 9},    // 災煞
	{3, 0, 9, 6, 3, 0, 9, 6, 3, 0, 9, 6},    // 六厄
}

//以月支對照月干及年日時干支之神煞
var SHEN_SHA_MONTH_ZHI_GAN_STR = []string{
	"天德貴人", "月德貴人", "天德合", "月德合", "月破", "血刃"}
var SHEN_SHA_MONTH_ZHI_GAN_LIST = [][12]int{
	// 寅 卯 辰 巳 午 未 申 酉 戌 亥 子 丑
	// 2  3  4  5  6  7  8  9  10 11 0  1
	{},
}

var SHEN_SHA_DAY_GAN_STR = []string{
	"天乙貴人", "文昌", "學堂", "金輿", "祿神", "沐浴", "紅豔", "羊刃", "飛刃", "墓庫", "流霞"}
var SHEN_SHA_YEAR_ZHI_LIST = [][12]int{}
*/

// 神煞排法
// http://piscesdai.pixnet.net/blog/post/370873481-%E5%85%AB%E5%AD%97%E6%8E%92%E6%B3%95%E6%95%99%E5%AD%B8%E3%80%90%E7%A5%9E%E7%85%9E%E6%98%9F%E6%A0%BC%E5%B1%80%E3%80%91

// 三奇
var SHEN_SHA_SAN_QI_STR = [3]string{"天上三奇", "地上三奇", "地上三奇"}
var SHEN_SHA_SAN_QI_LIST = [3][3]string{
	// 年干 月干 日干
	/*
		{0, 4, 6}, // 甲 戊 庚
		{1, 2, 7}, // 乙丙辛
		{8, 9, 7}, // 壬癸辛
	*/
	{"甲", "戊", "庚"},
	{"乙", "丙", "丁"},
	{"壬", "癸", "辛"},
}

// 魁罡,看柱,年月日时干支只要出现此组合则是魁罡
var SHEN_SHA_KUI_GANG_STR = "魁罡"

//var SHEN_SHA_KUI_GANG_LIST = [4][2]int{{4, 10}, {5, 10}, {6, 4}, {8, 4}} // 戊戌、庚戌、庚辰、壬辰
var SHEN_SHA_KUI_GANG_LIST = [4]string{"戊戌", "庚戌", "庚辰", "壬辰"}

// 年月日时支查日干表
var SHEN_SHA_DAY_GAN_ALL_ZHI_STR = []string{
	"天乙貴人", "太極貴人", "文昌貴人", "福興貴人", "天廚貴人", "金興", "干祿", "羊刃", "紅豔",
}
var SHEN_SHA_DAY_GAN_ALL_ZHI_LIST = [][10]int{
	// 子、丑、寅、卯、辰、巳、午、未、申、酉、戌、亥
	// 0,	1,	2,	3,	4,	5,	6,	7,	8,	9,	10,	11
	/*
		{{1, 7, -1, -1}, {0, 8, -1, -1}, {9, 11, -1, -1}, {9, 11, -1, -1}, {1, 7, -1, -1}, {0, 8, -1, -1}, {1, 7, -1, -1}, {2, 6, -1, -1}, {3, 5, -1, -1}, {3, 5, -1, -1}},           // 天乙貴人 ,丑未 子申 酉亥 酉亥 丑未 子申 丑未 寅午 卯巳 卯巳
		{{0, 6, -1, -1}, {0, 6, -1, -1}, {9, 3, -1, -1}, {9, 3, -1, -1}, {1, 4, 7, 10}, {1, 4, 7, 10}, {2, 11, -1, -1}, {2, 11, -1, -1}, {5, 8, -1, -1}, {5, 8, -1, -1}},             //太極貴人 子午 子午 酉卯 酉卯 丑辰未戌 丑辰未戌 寅亥 寅亥 巳申 巳申
		{{5, -1, -1, -1}, {6, -1, -1, -1}, {8, -1, -1, -1}, {9, -1, -1, -1}, {8, -1, -1, -1}, {9, -1, -1, -1}, {11, -1, -1, -1}, {0, -1, -1, -1}, {2, -1, -1, -1}, {3, -1, -1, -1}},  //文昌貴人 巳 午 申 酉 申 酉 亥 子 寅 卯
		{{2, -1, -1, -1}, {1, 11, -1, -1}, {10, 0, -1, -1}, {9, -1, -1, -1}, {8, -1, -1, -1}, {7, -1, -1, -1}, {6, -1, -1, -1}, {5, -1, -1, -1}, {4, -1, -1, -1}, {1, -1, -1, -1}},   // 福興貴人 寅 丑亥 戌子 酉 申 未 午 巳 辰 丑
		{{5, -1, -1, -1}, {6, -1, -1, -1}, {5, -1, -1, -1}, {6, -1, -1, -1}, {8, -1, -1, -1}, {9, -1, -1, -1}, {11, -1, -1, -1}, {0, -1, -1, -1}, {2, -1, -1, -1}, {3, -1, -1, -1}},  // 天廚貴人 巳 午 巳 午 申 酉 亥 子 寅 卯
		{{4, -1, -1, -1}, {5, -1, -1, -1}, {7, -1, -1, -1}, {8, -1, -1, -1}, {7, -1, -1, -1}, {8, -1, -1, -1}, {10, -1, -1, -1}, {11, -1, -1, -1}, {1, -1, -1, -1}, {2, -1, -1, -1}}, // 金興 辰 巳 未 申 未 申 戌 亥 丑 寅
		{{2, -1, -1, -1}, {3, -1, -1, -1}, {5, -1, -1, -1}, {6, -1, -1, -1}, {5, -1, -1, -1}, {6, -1, -1, -1}, {8, -1, -1, -1}, {9, -1, -1, -1}, {11, -1, -1, -1}, {0, -1, -1, -1}},  // 干祿 寅 卯 巳 午 巳 午 申 酉 亥 子
		{{3, -1, -1, -1}, {2, 4, -1, -1}, {6, -1, -1}, {5, 6, -1, -1}, {6, -1, -1, -1}, {5, 6, -1, -1}, {9, -1, -1, -1}, {8, 10, -1, -1}, {0, -1, -1, -1}, {11, 1, -1, -1}},          // 羊刃 卯 寅辰 午 巳午 午 巳午 酉 申戌 子 亥丑
		{{6, -1, -1, -1}, {6, -1, -1, -1}, {2, -1, -1, -1}, {7, -1, -1, -1}, {4, -1, -1, -1}, {4, -1, -1, -1}, {10, -1, -1, -1}, {9, -1, -1, -1}, {0, -1, -1, -1}, {8, -1, -1, -1}},  // 紅豔 午 午 寅 未 辰 辰 戌 酉 子 申
	*/
	{"丑未", "子申", "酉亥", "酉亥", "丑未", "子申", "丑未", "寅午", "卯巳", "卯巳"},
	{"子午", "子午", "酉卯", "酉卯", "丑辰", "未戌", "丑辰", "未戌", "寅亥", "寅亥", "巳申", "巳申"},
	{"巳", "午", "申", "酉", "申", "酉", "亥", "子", "寅", "卯"},
	{"寅", "丑亥", "戌子", "酉", "申", "未", "午", "巳", "辰", "丑"},
	{"巳", "午", "巳", "午", "申", "酉", "亥", "子", "寅", "卯"},
	{"辰", "巳", "未", "申", "未", "申", "戌", "亥", "丑", "寅"},
	{"寅", "卯", "巳", "午", "巳", "午", "申", "酉", "亥", "子"},
	{"卯", "寅辰", "午", "巳午", "午", "巳午", "酉", "申戌", "子", "亥丑"},
	{"午", "午", "寅", "未", "辰", "辰", "戌", "酉", "子", "申"},
}

// 月干、年日时干支查月支表
var SHEN_SHA_MONTH_ZHI_STR = []string{
	"天德贵人", "天德合", "月德貴人", "月德合", "天医", "天赦", "四廢",
}

// 月干、年日时干查月支
var SHEN_SHA_MONTH_ZHI_ALL_GAN_LIST = [][12]int{
	/*
		{-1, 6, 3, -1, 8, 7, -1, 0, 9, -1, 2, 1},         // 天德貴人 巳 庚 丁 申 壬 辛 亥 甲 癸 寅 丙 乙
		{-1, 1, 8, -1, 3, 2, -1, -1, 4, -1, 7, 6},        // 天德合 申 乙 壬 巳 丁 丙 寅 巳 戊 亥 辛 庚
		{8, 6, 2, 0, 8, 6, 2, 0, 8, 6, 2, 0},             // 月德貴人 壬 庚 丙 甲 壬 庚 丙 甲 壬 庚 丙 甲
		{3, 1, 7, 5, 3, 1, 7, 5, 3, 1, 7, 5},             // 月德合 丁 乙 辛 己 丁 乙 辛 己 丁 乙 辛 己
		{-1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1}, // 天醫 亥 子 丑 寅 卯 辰 巳 午 未 申 酉 戌
	*/

	{"巳", "庚", "丁", "申", "壬", "辛", "亥", "甲", "癸", "寅", "丙", "乙"},
	{"申", "乙", "壬", "巳", "丁", "丙", "寅", "巳", "戊", "亥", "辛", "庚"},
	{"壬", "庚", "丙", "甲", "壬", "庚", "丙", "甲", "壬", "庚", "丙", "甲"},
	{"丁", "乙", "辛", "己", "丁", "乙", "辛", "己", "丁", "乙", "辛", "己"},
	{"亥", "子", "丑", "寅", "卯", "辰", "巳", "午", "未", "申", "酉", "戌"},
	{"甲子", "甲子", "戊寅", "戊寅", "戊寅", "甲午", "甲午", "甲午", "戊申", "戊申", "戊申", "甲子"},
	{"丙午丁巳", "丙午丁巳", "庚申辛酉", "庚申辛酉", "庚申辛酉", "壬子癸亥", "壬子癸亥", "壬子癸亥", "甲寅乙卯", "甲寅乙卯", "甲寅乙卯", "丙午丁巳"},
}

/*
// 年日时支查月支表
var SHEN_SHA_MONTH_ZHI_ZHI_LIST = [][12]int{
	{5, -1, -1, 8, -1, -1, 11, -1, -1, 2, -1, -1},    // 天德貴人 巳 庚 丁 申 壬 辛 亥 甲 癸 寅 丙 乙
	{8, -1, -1, 5, -1, -1, 2, 5, -1, 11, -1, -1},     // 天德合 申 乙 壬 巳 丁 丙 寅 巳 戊 亥 辛 庚
	{-1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1}, // 月德貴人 壬 庚 丙 甲 壬 庚 丙 甲 壬 庚 丙 甲
	{-1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1}, // 月德合 丁 乙 辛 己 丁 乙 辛 己 丁 乙 辛 己
	{11, 0, 1, 2, 3, 4, 5, 6, 7, 8, 9, 10},           // 天醫 亥 子 丑 寅 卯 辰 巳 午 未 申 酉 戌
}

// 天赦，日柱与月支满足
var SHEN_SHA_TIAN_SHE_STR = "天赦"
var SHEN_SHA_TIAN_SHE_LIST = [12][2]int{
	// 月支 子 丑 寅 卯 辰 巳 午 未 申 酉 戌 亥
	// 天赦 甲子 甲子 戊寅 戊寅 戊寅 甲午 甲午 甲午 戊申 戊申 戊申 甲子
	{0, 0}, {0, 0}, {4, 2}, {4, 2}, {4, 2}, {0, 6}, {0, 6}, {0, 6}, {4, 8}, {4, 8}, {4, 8}, {0, 0},
}

// 四廢，日柱与月支满足
var SHEN_SHA_SI_FEI_STR = "四廢"
var SHEN_SHA_SI_FEI_LIST = [12][4]int{
	// 四廢 丙午丁巳 丙午丁巳 庚申辛酉 庚申辛酉 庚申辛酉 壬子癸亥 壬子癸亥 壬子癸亥 甲寅乙卯 甲寅乙卯 甲寅乙卯 丙午丁巳
	{2, 6, 3, 5}, {2, 6, 3, 5}, {6, 8, 7, 9}, {6, 8, 7, 9}, {6, 8, 7, 9}, {8, 0, 9, 11}, {8, 0, 9, 11}, {8, 0, 9, 11}, {0, 2, 1, 3}, {0, 2, 1, 3}, {2, 6, 3, 5},
}
*/

// 年月日时干查日支表
var SHEN_SHA_DAY_ZHI_ALL_ZHI_STR = []string{
	"驛馬", "華蓋", "將星", "亡神", "劫煞", "孤辰", "寡宿", "咸池", "天喜", "紅鸞",
}
var SHEN_SHA_DAY_ZHI_ALL_ZHI_STR = [][12]string{
	/*驛馬*/ {"寅", "亥", "申", "巳", "寅", "亥", "申", "巳", "寅", "亥", "申", "巳"},
	/*華蓋*/ {"辰", "丑", "戌", "未", "辰", "丑", "戌", "未", "辰", "丑", "戌", "未"},
	/*將星*/ {"子", "酉", "午", "卯", "子", "酉", "午", "卯", "子", "酉", "午", "卯"},
	/*亡神*/ {"亥", "申", "巳", "寅", "亥", "申", "巳", "寅", "亥", "申", "巳", "寅"},
	/*劫煞*/ {"巳", "寅", "亥", "申", "巳", "寅", "亥", "申", "巳", "寅", "亥", "申"},
	/*孤辰*/ {"寅", "寅", "巳", "巳", "巳", "申", "申", "申", "亥", "亥", "亥", "寅"},
	/*寡宿*/ {"戌", "戌", "丑", "丑", "丑", "辰", "辰", "辰", "未", "未", "未", "戌"},
	/*咸池*/ {"酉", "午", "卯", "子", "酉", "午", "卯", "子", "酉", "午", "卯", "子"},
	/*天喜*/ {"酉", "申", "未", "午", "酉", "申", "未", "午", "酉", "申", "未", "午"},
	/*紅鸞*/ {"卯", "寅", "丑", "子", "亥", "戌", "酉", "申", "未", "午", "巳", "辰"},
}

// 日支查日干
var SHEN_SHA_DAY_ZHI_DAY_GAN_STR = []string{
	"金神", "魁罡", "十惡大敗", "陰差陽錯", "八專", "九醜",
}
var SHEN_SHA_DAY_ZHI_DAY_GAN_LIST = [][12]string{
	/*金神*/ {"", "乙", "", "", "", "", "己", "", "", "", "癸", ""},
	/*魁罡*/ {"", "", "", "", "壬庚", "", "", "", "", "", "庚戊", ""},
	/*十惡大敗*/ {"", "己", "", "", "甲庚", "乙辛", "", "", "丙壬", "", "戊", "丁癸"},
	/*陰差陽錯*/ {"丙", "丁", "戊", "辛", "壬", "癸", "丙", "丁", "戊", "辛", "壬", "癸"},
	/*八專*/ {"", "癸", "甲", "乙", "", "", "", "己丁", "庚", "辛", "戊", ""},
	/*九醜*/ {"戊壬", "", "", "己辛", "", "", "戊壬", "", "", "丁己辛", "", ""},
}

// 时支查地支
var SHEN_SHA_HOUR_ZHI_ALL_ZHI_STR = "金神"
var SHEN_SHA_HOUR_ZHI_ALL_ZHI_LIST = [12]string{
	/*金神*/ "", "乙", "", "", "", "", "己", "", "", "", "癸", "",
}

// 年支查日月时支
var SHEN_SHA_YEAR_ZHI_ALL_ZHI_STR = []string{
	"驛馬", "華蓋", "將星", "亡神", "劫煞", "災煞", "孤辰", "寡宿", "咸池", "天喜", "紅鸞", "丧门", "白虎", "吊客", "病符", "血刃",
}

// dd
