package SiZhu

// 四季用神, 日干，出生月份查表

var SJYS_STR = [4][5]string{
	{
		"喜有土、火，最忌没有土、金",          // 金，春
		"必须有火助，有水更好，但忌水太多，也忌土太多", // 木，春
		"必须有土相助，若有火，金，但忌金多",
		"此时必为丙火或丁火，大都不错，但忌木多、土多",
		"喜有火、木，喜有金而少，忌金多、木多",
	},
	{
		"必须有水相助，忌木多", // 金，夏
		"必须有水相助，忌土太多，也忌木太多",
		"必须有金相助，忌木多",
		"必须有水相助，最喜有金",
		"喜有水、金，忌有木",
	},
	{
		"喜有木、火，忌土多", // 金，秋
		"必须有金相助，但忌金太多，须有土、火才好，但忌水多",
		"必须有金相助，忌土、金、水多，喜木、火",
		"喜有木，忌水、土多",
		"喜有火，有木，忌金、水多",
	},
	{
		"必须有火、土相助，忌无火、土反而有金、水，忌木多而无火",
		"必须有火相助，最好有土、水",
		"必须有火相助，喜水多，但忌金多",
		"必须有木相助，忌有水与金多，喜有土、水、木",
		"喜有火，更喜有火又有金，喜有土、木",
	},
}
